{
  "24h": [
    "24 hours clean. Your addiction is pissed and confused.",
    "24 hours without using. Your body is stunned. Your brain is suspicious.",
    "24 hours and you didn’t explode. That’s illegal in your old script.",
    "24 hours clean. Sobriety wasn’t a typo after all.",
    "24 hours without your favorite poison. Your addiction was expecting a buffet.",
    "24 hours of not self-destructing. Terrifying proof you can pause.",
    "24 hours clean and your addiction didn’t see it coming.",
    "24 hours — you’re now too sober to blame the universe for everything.",
    "24 hours clean. Your cravings showed up. You didn’t.",
    "24 hours without feeding the beast. Your self-destruction schedule is disrupted."
  ],

  "1w": [
    "One full week clean. Your chaos is now on a leash.",
    "Seven days clean. Your brain has started filing complaint forms.",
    "One week without numbing out. You remembered how sleep works. Weird.",
    "Seven days clean and you ignored ‘urgent’ impulses. That’s rude and iconic.",
    "One week clean. Your excuses are running out of battery.",
    "Seven days in and your brain still hasn’t exploded. Deeply inconvenient.",
    "One week clean — your addiction just realized you might be serious. Oops.",
    "Seven days of reality. You’re developing a tolerance. Brave.",
    "One week clean and your impulses officially hate your calendar.",
    "Seven days with your own thoughts. You survived. Medal unlocked."
  ],

  "2w": [
    "Two weeks clean. Feelings detected. Uninstall not available.",
    "14 days in — you’re emotionally buffering instead of disappearing.",
    "Two weeks clean. Reality is downloading. Please wait.",
    "14 days without running. Your nervous system is suspicious.",
    "Two weeks clean and your coping mechanisms are googling unemployment.",
    "14 days in and you still haven’t imploded. Fascinating.",
    "Two weeks clean. Your chaos subscription is expiring.",
    "14 days of showing up — your feelings can’t believe you’re still here.",
    "Two weeks and your brain is negotiating a relapse. Decline the offer.",
    "14 days clean. Your excuses are officially out of plot twists."
  ],
    "30d": [
    "30 days clean. Your brain wanted chaos — you said 'not today'.",
    "30 days and you outlasted impulses that swore they were emergencies.",
    "One month clean. Who are you and where did the apocalypse go?",
    "30 days without your drug of choice. Your addiction lost the remote.",
    "30 days alive in a life you used to avoid. That's rude.",
    "30 days clean and you’ve outlived a month of your own bullshit.",
    "30 days and your addiction is sending follow-up emails. Leave them unread.",
    "One month clean. Your identity is having an existential crisis. Good.",
    "30 days clean and oblivion isn’t the default setting anymore. Annoying, right?",
    "30 days — your emotions are forming a union. Handle with snacks."
  ],

  "60d": [
    "60 days clean. Your cravings have been demoted to suggestions.",
    "Two months clean — your addiction is checking your LinkedIn for openings.",
    "60 days and you can’t call this an accident anymore.",
    "60 days without outsourcing your emotions. Your brain is scandalized.",
    "Two months clean and your old habits are asking for visitation rights.",
    "60 days in — your denial is packing its bags.",
    "Two months clean and your past is stalking your social media.",
    "60 days and cravings now require a permission slip.",
    "Two months clean — your survival mode is officially out of office.",
    "60 days and your inner saboteur is revising its business model."
  ],

  "90d": [
    "90 days clean. Your addiction hates your consistency.",
    "Three months clean — that’s a personality plot twist.",
    "90 days and you’re harder to manipulate than you used to be.",
    "Three months clean. Your brain is rebooting without the malware.",
    "90 days clean — your past thought you'd fail by now. Plot twist.",
    "Three months in and your brain still can’t believe it’s happening.",
    "90 days — your past self wouldn’t recognize you. Good.",
    "Three months clean and your emotional software is updating. Do not shut down.",
    "90 days clean — addiction wants visitation rights. Denied.",
    "Three months and your self-worth is learning to walk."
  ],

  "6m": [
    "Six months clean. Your addiction is in therapy about it.",
    "Half a year clean — you’ve outstayed your worst impulses.",
    "6 months and your life didn’t collapse. Your identity did — in a good way.",
    "Six months clean and you’re fluent in emotions. Still hate them, though.",
    "6 months — your nervous system is filing patch notes.",
    "Half a year clean. Your recovery now has lore, maps, and side quests.",
    "Six months clean — your addiction is drafting a comeback tour. Ignore it.",
    "6 months and your nervous system is learning trust like a foreign language.",
    "Half a year clean — your clarity is starting to look permanent. Suspicious.",
    "Six months — your chaos called. You blocked the number."
  ],

  "9m": [
    "Nine months clean. Your past version is speechless.",
    "9 months clean — you're running a system update on your existence.",
    "Nine months and your addiction keeps refreshing your profile like a stalker.",
    "9 months — your coping skills are evolving without permission.",
    "Nine months without a relapse arc. Your story has range.",
    "9 months — your brain is running out of apocalypse scenarios.",
    "Nine months clean. Your impulses realized you read the manual.",
    "9 months — your past patterns are looking for loopholes.",
    "Nine months clean. Your emotional stamina got promoted.",
    "9 months — your addiction doesn't know where you live anymore."
  ],

  "1y": [
    "One year clean — your addiction is officially unemployed.",
    "365 days clean. You built a life you don’t need to escape from.",
    "One year later — you’re the plot twist your brain never approved.",
    "12 months clean. Recovery has lore. And sequels.",
    "One year doesn’t make you perfect — it makes you undeniable.",
    "365 days — your recovery has plot armor now.",
    "One year clean. Your addiction is no longer the main character.",
    "365 days — your future is louder than your excuses.",
    "One year clean. Your life finally fits inside your body.",
    "12 months clean — your story survived the edit."
  ]
}
